Revit 2026 API

# ViewCropRegionShapeManagerRemoveCropRegionShape Method

---

Removes any non-rectangular boundary of the view's crop.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCropRegionShape()
```
```vb
Public Sub RemoveCropRegionShape
```
```cpp
public:
void RemoveCropRegionShape()
```
```fsharp
member RemoveCropRegionShape : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The crop of the associated view is not permitted to have a non-rectangular shape. |

#### Reference

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace